/* automatically generated by rust-bindgen 0.59.2 */

pub const XMPP_NS_CLIENT: &[u8; 14usize] = b"jabber:client\0";
pub const XMPP_NS_COMPONENT: &[u8; 24usize] = b"jabber:component:accept\0";
pub const XMPP_NS_STREAMS: &[u8; 33usize] = b"http://etherx.jabber.org/streams\0";
pub const XMPP_NS_STREAMS_IETF: &[u8; 36usize] = b"urn:ietf:params:xml:ns:xmpp-streams\0";
pub const XMPP_NS_STANZAS_IETF: &[u8; 36usize] = b"urn:ietf:params:xml:ns:xmpp-stanzas\0";
pub const XMPP_NS_TLS: &[u8; 32usize] = b"urn:ietf:params:xml:ns:xmpp-tls\0";
pub const XMPP_NS_SASL: &[u8; 33usize] = b"urn:ietf:params:xml:ns:xmpp-sasl\0";
pub const XMPP_NS_BIND: &[u8; 33usize] = b"urn:ietf:params:xml:ns:xmpp-bind\0";
pub const XMPP_NS_SESSION: &[u8; 36usize] = b"urn:ietf:params:xml:ns:xmpp-session\0";
pub const XMPP_NS_AUTH: &[u8; 15usize] = b"jabber:iq:auth\0";
pub const XMPP_NS_DISCO_INFO: &[u8; 38usize] = b"http://jabber.org/protocol/disco#info\0";
pub const XMPP_NS_DISCO_ITEMS: &[u8; 39usize] = b"http://jabber.org/protocol/disco#items\0";
pub const XMPP_NS_ROSTER: &[u8; 17usize] = b"jabber:iq:roster\0";
pub const XMPP_NS_REGISTER: &[u8; 19usize] = b"jabber:iq:register\0";
pub const XMPP_EOK: u32 = 0;
pub const XMPP_EMEM: i32 = -1;
pub const XMPP_EINVOP: i32 = -2;
pub const XMPP_EINT: i32 = -3;
pub const XMPP_CONN_FLAG_DISABLE_TLS: u32 = 1;
pub const XMPP_CONN_FLAG_MANDATORY_TLS: u32 = 2;
pub const XMPP_CONN_FLAG_LEGACY_SSL: u32 = 4;
pub const XMPP_CONN_FLAG_TRUST_TLS: u32 = 8;
pub const XMPP_CONN_FLAG_LEGACY_AUTH: u32 = 16;
pub const XMPP_SHA1_DIGEST_SIZE: u32 = 20;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn xmpp_initialize();
}
extern "C" {
    pub fn xmpp_shutdown();
}
extern "C" {
    pub fn xmpp_version_check(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type xmpp_mem_t = _xmpp_mem_t;
pub type xmpp_log_t = _xmpp_log_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_ctx_t {
    _unused: [u8; 0],
}
pub type xmpp_ctx_t = _xmpp_ctx_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_tlscert_t {
    _unused: [u8; 0],
}
pub type xmpp_tlscert_t = _xmpp_tlscert_t;
extern "C" {
    pub fn xmpp_ctx_new(mem: *const xmpp_mem_t, log: *const xmpp_log_t) -> *mut xmpp_ctx_t;
}
extern "C" {
    pub fn xmpp_ctx_free(ctx: *mut xmpp_ctx_t);
}
extern "C" {
    pub fn xmpp_ctx_set_verbosity(ctx: *mut xmpp_ctx_t, level: ::std::os::raw::c_int);
}
extern "C" {
    pub fn xmpp_free(ctx: *const xmpp_ctx_t, p: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_mem_t {
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(
            size: size_t,
            userdata: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub free: ::std::option::Option<
        unsafe extern "C" fn(p: *mut ::std::os::raw::c_void, userdata: *mut ::std::os::raw::c_void),
    >,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            size: size_t,
            userdata: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__xmpp_mem_t() {
    assert_eq!(
        ::std::mem::size_of::<_xmpp_mem_t>(),
        32usize,
        concat!("Size of: ", stringify!(_xmpp_mem_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_xmpp_mem_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_xmpp_mem_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_mem_t>())).alloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_mem_t),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_mem_t>())).free as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_mem_t),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_mem_t>())).realloc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_mem_t),
            "::",
            stringify!(realloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_mem_t>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_mem_t),
            "::",
            stringify!(userdata)
        )
    );
}
pub const xmpp_log_level_t_XMPP_LEVEL_DEBUG: xmpp_log_level_t = 0;
pub const xmpp_log_level_t_XMPP_LEVEL_INFO: xmpp_log_level_t = 1;
pub const xmpp_log_level_t_XMPP_LEVEL_WARN: xmpp_log_level_t = 2;
pub const xmpp_log_level_t_XMPP_LEVEL_ERROR: xmpp_log_level_t = 3;
pub type xmpp_log_level_t = ::std::os::raw::c_uint;
pub const xmpp_conn_type_t_XMPP_UNKNOWN: xmpp_conn_type_t = 0;
pub const xmpp_conn_type_t_XMPP_CLIENT: xmpp_conn_type_t = 1;
pub const xmpp_conn_type_t_XMPP_COMPONENT: xmpp_conn_type_t = 2;
pub type xmpp_conn_type_t = ::std::os::raw::c_uint;
pub type xmpp_log_handler = ::std::option::Option<
    unsafe extern "C" fn(
        userdata: *mut ::std::os::raw::c_void,
        level: xmpp_log_level_t,
        area: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_log_t {
    pub handler: xmpp_log_handler,
    pub userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__xmpp_log_t() {
    assert_eq!(
        ::std::mem::size_of::<_xmpp_log_t>(),
        16usize,
        concat!("Size of: ", stringify!(_xmpp_log_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_xmpp_log_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_xmpp_log_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_log_t>())).handler as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_log_t),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xmpp_log_t>())).userdata as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_xmpp_log_t),
            "::",
            stringify!(userdata)
        )
    );
}
extern "C" {
    pub fn xmpp_get_default_logger(level: xmpp_log_level_t) -> *mut xmpp_log_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_conn_t {
    _unused: [u8; 0],
}
pub type xmpp_conn_t = _xmpp_conn_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmpp_stanza_t {
    _unused: [u8; 0],
}
pub type xmpp_stanza_t = _xmpp_stanza_t;
pub const xmpp_conn_event_t_XMPP_CONN_CONNECT: xmpp_conn_event_t = 0;
pub const xmpp_conn_event_t_XMPP_CONN_RAW_CONNECT: xmpp_conn_event_t = 1;
pub const xmpp_conn_event_t_XMPP_CONN_DISCONNECT: xmpp_conn_event_t = 2;
pub const xmpp_conn_event_t_XMPP_CONN_FAIL: xmpp_conn_event_t = 3;
pub type xmpp_conn_event_t = ::std::os::raw::c_uint;
pub const xmpp_error_type_t_XMPP_SE_BAD_FORMAT: xmpp_error_type_t = 0;
pub const xmpp_error_type_t_XMPP_SE_BAD_NS_PREFIX: xmpp_error_type_t = 1;
pub const xmpp_error_type_t_XMPP_SE_CONFLICT: xmpp_error_type_t = 2;
pub const xmpp_error_type_t_XMPP_SE_CONN_TIMEOUT: xmpp_error_type_t = 3;
pub const xmpp_error_type_t_XMPP_SE_HOST_GONE: xmpp_error_type_t = 4;
pub const xmpp_error_type_t_XMPP_SE_HOST_UNKNOWN: xmpp_error_type_t = 5;
pub const xmpp_error_type_t_XMPP_SE_IMPROPER_ADDR: xmpp_error_type_t = 6;
pub const xmpp_error_type_t_XMPP_SE_INTERNAL_SERVER_ERROR: xmpp_error_type_t = 7;
pub const xmpp_error_type_t_XMPP_SE_INVALID_FROM: xmpp_error_type_t = 8;
pub const xmpp_error_type_t_XMPP_SE_INVALID_ID: xmpp_error_type_t = 9;
pub const xmpp_error_type_t_XMPP_SE_INVALID_NS: xmpp_error_type_t = 10;
pub const xmpp_error_type_t_XMPP_SE_INVALID_XML: xmpp_error_type_t = 11;
pub const xmpp_error_type_t_XMPP_SE_NOT_AUTHORIZED: xmpp_error_type_t = 12;
pub const xmpp_error_type_t_XMPP_SE_POLICY_VIOLATION: xmpp_error_type_t = 13;
pub const xmpp_error_type_t_XMPP_SE_REMOTE_CONN_FAILED: xmpp_error_type_t = 14;
pub const xmpp_error_type_t_XMPP_SE_RESOURCE_CONSTRAINT: xmpp_error_type_t = 15;
pub const xmpp_error_type_t_XMPP_SE_RESTRICTED_XML: xmpp_error_type_t = 16;
pub const xmpp_error_type_t_XMPP_SE_SEE_OTHER_HOST: xmpp_error_type_t = 17;
pub const xmpp_error_type_t_XMPP_SE_SYSTEM_SHUTDOWN: xmpp_error_type_t = 18;
pub const xmpp_error_type_t_XMPP_SE_UNDEFINED_CONDITION: xmpp_error_type_t = 19;
pub const xmpp_error_type_t_XMPP_SE_UNSUPPORTED_ENCODING: xmpp_error_type_t = 20;
pub const xmpp_error_type_t_XMPP_SE_UNSUPPORTED_STANZA_TYPE: xmpp_error_type_t = 21;
pub const xmpp_error_type_t_XMPP_SE_UNSUPPORTED_VERSION: xmpp_error_type_t = 22;
pub const xmpp_error_type_t_XMPP_SE_XML_NOT_WELL_FORMED: xmpp_error_type_t = 23;
pub type xmpp_error_type_t = ::std::os::raw::c_uint;
#[doc = "< X.509 Version"]
pub const xmpp_cert_element_t_XMPP_CERT_VERSION: xmpp_cert_element_t = 0;
#[doc = "< SerialNumber"]
pub const xmpp_cert_element_t_XMPP_CERT_SERIALNUMBER: xmpp_cert_element_t = 1;
#[doc = "< Subject"]
pub const xmpp_cert_element_t_XMPP_CERT_SUBJECT: xmpp_cert_element_t = 2;
#[doc = "< Issuer"]
pub const xmpp_cert_element_t_XMPP_CERT_ISSUER: xmpp_cert_element_t = 3;
#[doc = "< Issued on"]
pub const xmpp_cert_element_t_XMPP_CERT_NOTBEFORE: xmpp_cert_element_t = 4;
#[doc = "< Expires on"]
pub const xmpp_cert_element_t_XMPP_CERT_NOTAFTER: xmpp_cert_element_t = 5;
#[doc = "< Public Key Algorithm"]
pub const xmpp_cert_element_t_XMPP_CERT_KEYALG: xmpp_cert_element_t = 6;
#[doc = "< Certificate Signature Algorithm"]
pub const xmpp_cert_element_t_XMPP_CERT_SIGALG: xmpp_cert_element_t = 7;
#[doc = "< Fingerprint SHA-1"]
pub const xmpp_cert_element_t_XMPP_CERT_FINGERPRINT_SHA1: xmpp_cert_element_t = 8;
#[doc = "< Fingerprint SHA-256"]
pub const xmpp_cert_element_t_XMPP_CERT_FINGERPRINT_SHA256: xmpp_cert_element_t = 9;
#[doc = "< Last element of the enum"]
pub const xmpp_cert_element_t_XMPP_CERT_ELEMENT_MAX: xmpp_cert_element_t = 10;
#[doc = " Certificate Elements"]
#[doc = ""]
#[doc = "  @ingroup TLS"]
pub type xmpp_cert_element_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xmpp_stream_error_t {
    pub type_: xmpp_error_type_t,
    pub text: *mut ::std::os::raw::c_char,
    pub stanza: *mut xmpp_stanza_t,
}
#[test]
fn bindgen_test_layout_xmpp_stream_error_t() {
    assert_eq!(
        ::std::mem::size_of::<xmpp_stream_error_t>(),
        24usize,
        concat!("Size of: ", stringify!(xmpp_stream_error_t))
    );
    assert_eq!(
        ::std::mem::align_of::<xmpp_stream_error_t>(),
        8usize,
        concat!("Alignment of ", stringify!(xmpp_stream_error_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xmpp_stream_error_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xmpp_stream_error_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xmpp_stream_error_t>())).text as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xmpp_stream_error_t),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xmpp_stream_error_t>())).stanza as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xmpp_stream_error_t),
            "::",
            stringify!(stanza)
        )
    );
}
pub type xmpp_conn_handler = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut xmpp_conn_t,
        event: xmpp_conn_event_t,
        error: ::std::os::raw::c_int,
        stream_error: *mut xmpp_stream_error_t,
        userdata: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " The Handler function which will be called when the TLS stack can't"]
#[doc = "  verify the authenticity of a Certificate that gets presented by"]
#[doc = "  the server we're trying to connect to."]
#[doc = ""]
#[doc = "  When this function is called and details of the `cert` have to be"]
#[doc = "  kept, please copy them yourself. The `cert` object will be free'd"]
#[doc = "  automatically when this function returns."]
#[doc = ""]
#[doc = "  NB: `errormsg` is specific per certificate on OpenSSL and the same"]
#[doc = "      for all certificates on GnuTLS."]
